
import Button from "./UI/Button"
import Card from "./UI/Card"

import ReactImg from "./../src/assets/react.svg"
import Card2 from "./UI/Card2"
import Alert from "./UI/Alert"
import Pagination from "./UI/Pagination"

function App() {


  return (
    <>
     {/* <GlobalStyle /> */}
     <Button>تست تستی</Button>
     <Card src={ReactImg} desc="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد." fullName="محمد قربانی" jobTitle="فرانت اند دولوپر" />
     <h1 className="bg-slate-700">d</h1>
     <Card2 />
     <Alert />
     <Pagination />
    </>
  )
}

export default App
